In [1]:
#SOME USEFUL COMMANDS THAT I MAY FORGOT!!:)

In [3]:
import pandas as pd
import numpy as np

In [10]:
#PD SERIES
series1 = pd.Series([1,2,3,4])
fruits = np.array(['apple','orange','mango','pear'])
series2 = pd.Series(fruits)
#series1
#series2

0    1
1    2
2    3
3    4
dtype: int64

In [40]:
#PD DATAFRAME
df = pd.DataFrame({
    "Column1": [1, 4, 8, 7, 9],
    "Column2": ['a', 'column', 'with', 'a', 'string'],
    "Column3": [1.23, 23.5, 45.6, 32.1234, 89.453],
    "Column4": [True, False, True, False, True]
})
df['Column1']
df

   Column1 Column2  Column3  Column4
0        1       a   1.2300     True
1        4  column  23.5000    False
2        8    with  45.6000     True
3        7       a  32.1234    False
4        9  string  89.4530     True

In [43]:
items = [['Phone', 2000], ['TV', 1500], ['Radio', 800]]
df = pd.DataFrame(items, columns=['Item', 'Price'], dtype=float)
df

    Item   Price
0  Phone  2000.0
1     TV  1500.0
2  Radio   800.0

In [44]:
df.Item == 'Phone'

0     True
1    False
2    False
Name: Item, dtype: bool

In [15]:
df.describe()

             Price
count     3.000000
mean   1433.333333
std     602.771377
min     800.000000
25%    1150.000000
50%    1500.000000
75%    1750.000000
max    2000.000000

In [ ]:
#LOC/ILOC

In [16]:
#MERGE

In [17]:
d = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'student_name': ['John', 'Emily', 'Kate', 'Joseph', 'Dennis']
}
df1 = pd.DataFrame(d, columns=['subject_id', 'student_name'])
df1

  subject_id student_name
0          1         John
1          2        Emily
2          3         Kate
3          4       Joseph
4          5       Dennis

In [18]:

data = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'student_name': ['Brian', 'William', 'Lilian', 'Grace', 'Caleb']
}
df2 = pd.DataFrame(data, columns=['subject_id', 'student_name'])
print(df2)

  subject_id student_name
0          4        Brian
1          5      William
2          6       Lilian
3          7        Grace
4          8        Caleb

In [21]:
df_final = df1.merge(df2,on='subject_id',how = 'outer')

In [22]:
df_final

  subject_id student_name_x student_name_y
0          1           John            NaN
1          2          Emily            NaN
2          3           Kate            NaN
3          4         Joseph          Brian
4          5         Dennis        William
5          6            NaN         Lilian
6          7            NaN          Grace
7          8            NaN          Caleb

In [23]:
pd.merge(df1, df2, on='subject_id')

  subject_id student_name_x student_name_y
0          4         Joseph          Brian
1          5         Dennis        William

In [24]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html

In [30]:
#GROUPBY
raw = {
    'Name': ['John', 'John', 'Grace', 'Grace', 'Benjamin', 'Benjamin', 'Benjamin',
        'Benjamin', 'John', 'Alex', 'Alex', 'Alex'],
    'Position': [2, 1, 1, 4, 2, 4, 3, 1, 3, 2, 4, 3],
    'Year': [2009, 2010, 2009, 2010, 2010, 2010, 2011, 2012, 2011, 2013, 2013, 2012],
    'Marks':[408, 398, 422, 376, 401, 380, 396, 388, 356, 402, 368, 378]
}
df = pd.DataFrame(raw)

        Name  Position  Year  Marks
0       John         2  2009    408
1       John         1  2010    398
2      Grace         1  2009    422
3      Grace         4  2010    376
4   Benjamin         2  2010    401
5   Benjamin         4  2010    380
6   Benjamin         3  2011    396
7   Benjamin         1  2012    388
8       John         3  2011    356
9       Alex         2  2013    402
10      Alex         4  2013    368
11      Alex         3  2012    378

In [34]:
group = df.groupby('Year')
df.groupby(['Year']).mean()

      Position   Marks
Year
2009      1.50  415.00
2010      2.75  388.75
2011      3.00  376.00
2012      2.00  383.00
2013      3.00  385.00

In [36]:
print(group.get_group(2010))

       Name  Position  Year  Marks
1      John         1  2010    398
3     Grace         4  2010    376
4  Benjamin         2  2010    401
5  Benjamin         4  2010    380

In [37]:
#Concatenation
df3 = pd.concat([df1, df2])

  subject_id student_name
0          1         John
1          2        Emily
2          3         Kate
3          4       Joseph
4          5       Dennis
0          4        Brian
1          5      William
2          6       Lilian
3          7        Grace
4          8        Caleb